adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl_peripherals.h
#define LRCCONF130_POWERON 1                         /*!< (unspecified)                                                        */
#define LRCCONF130_RETAIN 1                          /*!< (unspecified)                                                        */
#define LRCCONF130_SYSTEMOFF 1                       /*!< (unspecified)                                                        */
#define LRCCONF130_LRCREQHFXO 1                      /*!< (unspecified)                                                        */
#define LRCCONF130_NCLK_MIN 0                        /*!< (unspecified)                                                        */
#define LRCCONF130_NCLK_MAX 0                        /*!< (unspecified)                                                        */
#define LRCCONF130_NCLK_SIZE 1                       /*!< (unspecified)                                                        */
#define LRCCONF130_CLKCTRL 1                         /*!< (unspecified)                                                        */
#define LRCCONF130_NACTPD_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF130_NACTPD_MAX 0                      /*!< (unspecified)                                                        */
#define LRCCONF130_NACTPD_SIZE 1                     /*!< (unspecified)                                                        */
#define LRCCONF130_PDACT 1                           /*!< (unspecified)                                                        */
#define LRCCONF130_NPD_MIN 0                         /*!< (unspecified)                                                        */
#define LRCCONF130_NPD_MAX 10                        /*!< (unspecified)                                                        */
#define LRCCONF130_NPD_SIZE 11                       /*!< (unspecified)                                                        */
#define LRCCONF130_OTHERON 1                         /*!< (unspecified)                                                        */
#define LRCCONF130_NDOMAINS_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF130_NDOMAINS_MAX 15                   /*!< (unspecified)                                                        */
#define LRCCONF130_NDOMAINS_SIZE 16                  /*!< (unspecified)                                                        */
#define LRCCONF130_AX2XWAITSTATES 0                  /*!< (unspecified)                                                        */
#define LRCCONF130_POWERON_MAIN_RESET 1              /*!< Reset value of register POWERON.MAIN: 1                              */
#define LRCCONF130_POWERON_ACT_RESET 1               /*!< Reset value of register POWERON.ACT: 1                               */
#define LRCCONF130_RETAIN_MAIN_RESET 1               /*!< Reset value of register RETAIN.MAIN: 1                               */
#define LRCCONF130_RETAIN_ACT_RESET 1                /*!< Reset value of register RETAIN.ACT: 1                                */

/*PCGC Master*/
#define PCGCMASTER_PRESENT 1
#define PCGCMASTER_COUNT 14

#define PCGCM200_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM200_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM200_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM200_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM210_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM210_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM210_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM210_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM110_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM110_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM110_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM110_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM120_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM120_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM120_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM120_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM121_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM121_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM121_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM121_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM130_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM130_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM130_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM130_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM131_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM131_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM131_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM131_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM132_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM132_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM132_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM132_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM133_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM133_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM133_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM133_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

