adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl_peripherals.h
#define PCGCM134_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM134_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM134_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM134_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM135_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM135_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM135_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM135_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM136_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM136_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM136_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM136_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM137_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM137_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM137_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM137_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

#define PCGCM138_POWERCONSUMPTIONCALC 0              /*!< (unspecified)                                                        */
#define PCGCM138_SETPWRCONTHRESHOLDBASE 1            /*!< (unspecified)                                                        */
#define PCGCM138_CLOCKFORCEREG 1                     /*!< (unspecified)                                                        */
#define PCGCM138_MASTERFORCEREG 1                    /*!< (unspecified)                                                        */

/*PCGCSlave*/
#define PCGCSLAVE_PRESENT 1
#define PCGCSLAVE_COUNT 14

#define PCGCS200_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS200_NUM_CLOCK_POWER_PAIR_MAX 4          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS200_NUM_CLOCK_POWER_PAIR_SIZE 5         /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS200_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS200_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS110_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS110_NUM_CLOCK_POWER_PAIR_MAX 4          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS110_NUM_CLOCK_POWER_PAIR_SIZE 5         /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS110_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS110_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS120_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS120_NUM_CLOCK_POWER_PAIR_MAX 4          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS120_NUM_CLOCK_POWER_PAIR_SIZE 5         /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS120_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS120_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS121_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS121_NUM_CLOCK_POWER_PAIR_MAX 4          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS121_NUM_CLOCK_POWER_PAIR_SIZE 5         /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS121_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS121_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS122_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS122_NUM_CLOCK_POWER_PAIR_MAX 4          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS122_NUM_CLOCK_POWER_PAIR_SIZE 5         /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS122_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS122_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS130_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS130_NUM_CLOCK_POWER_PAIR_MAX 4          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS130_NUM_CLOCK_POWER_PAIR_SIZE 5         /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS130_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS130_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS131_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS131_NUM_CLOCK_POWER_PAIR_MAX 4          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS131_NUM_CLOCK_POWER_PAIR_SIZE 5         /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS131_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS131_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS132_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS132_NUM_CLOCK_POWER_PAIR_MAX 4          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS132_NUM_CLOCK_POWER_PAIR_SIZE 5         /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS132_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS132_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS133_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS133_NUM_CLOCK_POWER_PAIR_MAX 4          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS133_NUM_CLOCK_POWER_PAIR_SIZE 5         /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS133_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS133_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS134_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS134_NUM_CLOCK_POWER_PAIR_MAX 4          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS134_NUM_CLOCK_POWER_PAIR_SIZE 5         /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS134_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS134_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS135_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS135_NUM_CLOCK_POWER_PAIR_MAX 4          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS135_NUM_CLOCK_POWER_PAIR_SIZE 5         /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS135_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS135_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS136_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS136_NUM_CLOCK_POWER_PAIR_MAX 4          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS136_NUM_CLOCK_POWER_PAIR_SIZE 5         /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS136_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS136_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

#define PCGCS137_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS137_NUM_CLOCK_POWER_PAIR_MAX 4          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS137_NUM_CLOCK_POWER_PAIR_SIZE 5         /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS137_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS137_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

