adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl_peripherals.h
#define PCGCS138_NUM_CLOCK_POWER_PAIR_MIN 0          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS138_NUM_CLOCK_POWER_PAIR_MAX 4          /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS138_NUM_CLOCK_POWER_PAIR_SIZE 5         /*!< Number of clock/power pairs used by PCGC Slave - [0..4]              */
#define PCGCS138_NOTFULLPCPZERO 1                    /*!< (unspecified)                                                        */
#define PCGCS138_PENALTYTASKS 0                      /*!< (unspecified)                                                        */

/*VPR CLIC registers*/
#define CLIC_PRESENT 1
#define CLIC_COUNT 1

#define VPRCLIC_IRQ_COUNT 32
#define VPRCLIC_IRQNUM_MIN 0                         /*!< Supported interrupts (IRQNUM): 0..479                                */
#define VPRCLIC_IRQNUM_MAX 479                       /*!< Supported interrupts (IRQNUM): 0..479                                */
#define VPRCLIC_IRQNUM_SIZE 480                      /*!< Supported interrupts (IRQNUM): 0..479                                */
#define VPRCLIC_CLIC_NTASKS_MIN 0                    /*!< VEVIF tasks: 0..31                                                   */
#define VPRCLIC_CLIC_NTASKS_MAX 31                   /*!< VEVIF tasks: 0..31                                                   */
#define VPRCLIC_CLIC_NTASKS_SIZE 32                  /*!< VEVIF tasks: 0..31                                                   */
#define VPRCLIC_CLIC_TASKS_MASK 0xFFFFF0FF           /*!< Mask of supported VEVIF tasks: 0xFFFFF0FF                            */
#define VPRCLIC_COUNTER_IRQ_NUM 32                   /*!< VPR counter (CNT0) interrupt handler number (COUNTER_IRQ_NUM): 32    */
#define VPRCLIC_CLIC_VPR_1_2 1                       /*!< (unspecified)                                                        */

/*VTIM CSR registers*/
#define VTIM_PRESENT 1
#define VTIM_COUNT 1

/*Cache*/
#define CACHE_PRESENT 1
#define CACHE_COUNT 1

#define L2CACHE_VIRTUALCACHE 1                       /*!< (unspecified)                                                        */
#define L2CACHE_FLUSH 0                              /*!< (unspecified)                                                        */
#define L2CACHE_CLEAN 0                              /*!< (unspecified)                                                        */
#define L2CACHE_NONCACHEABLEMISS 0                   /*!< (unspecified)                                                        */
#define L2CACHE_BUSWIDTH_MIN 0                       /*!< Data bus width : 0..63                                               */
#define L2CACHE_BUSWIDTH_MAX 63                      /*!< Data bus width : 0..63                                               */
#define L2CACHE_BUSWIDTH_SIZE 64                     /*!< Data bus width : 0..63                                               */
#define L2CACHE_SECUREINVALIDATE 1                   /*!< (unspecified)                                                        */

/*RAM Controller*/
#define RAMC_PRESENT 1
#define RAMC_COUNT 7

#define RAMC110_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC110_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC111_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC111_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC120_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC120_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC121_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC121_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC130_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC130_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC131_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC131_SEC 0                                /*!< (unspecified)                                                        */

#define RAMC122_ECC 0                                /*!< (unspecified)                                                        */
#define RAMC122_SEC 0                                /*!< (unspecified)                                                        */

/*CRACEN*/
#define SHA3_PRESENT 1
#define SHA3_COUNT 1

#define SHA3_CRYPTOACCELERATOR 0                     /*!< (unspecified)                                                        */
#define SHA3_SEEDRAMLOCK 0                           /*!< (unspecified)                                                        */

/*EXternal Memory Encryption Engine*/
#define EXMEE_PRESENT 1
#define EXMEE_COUNT 1

/*MVDMA performs direct-memory-accesses between memories. Data is transferred according to job descriptor lists. Each transfer has corresponding source and sink descriptor lists with matching data amounts. The lists are in memory and they contain data buffer information, address pointers, buffer sizes and data type attributes.*/

#define MVDMA_PRESENT 1
#define MVDMA_COUNT 2

#define MVDMA110_COMPLETED_EVENT 1                   /*!< (unspecified)                                                        */
#define MVDMA110_DPPI_DISCONNECTED 0                 /*!< (unspecified)                                                        */
#define MVDMA110_INSTANCE_IN_WRAPPER 0               /*!< (unspecified)                                                        */

#define MVDMA120_COMPLETED_EVENT 1                   /*!< (unspecified)                                                        */
#define MVDMA120_DPPI_DISCONNECTED 1                 /*!< (unspecified)                                                        */
#define MVDMA120_INSTANCE_IN_WRAPPER 1               /*!< (unspecified)                                                        */

/*PPIB APB registers*/
#define PPIB_PRESENT 1
#define PPIB_COUNT 11

#define PPIB110_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB110_NTASKSEVENTS_MAX 3                   /*!< (unspecified)                                                        */
#define PPIB110_NTASKSEVENTS_SIZE 4                  /*!< (unspecified)                                                        */

#define PPIB120_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB120_NTASKSEVENTS_MAX 3                   /*!< (unspecified)                                                        */
#define PPIB120_NTASKSEVENTS_SIZE 4                  /*!< (unspecified)                                                        */

#define PPIB121_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB121_NTASKSEVENTS_MAX 7                   /*!< (unspecified)                                                        */
#define PPIB121_NTASKSEVENTS_SIZE 8                  /*!< (unspecified)                                                        */

#define PPIB130_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB130_NTASKSEVENTS_MAX 31                  /*!< (unspecified)                                                        */
#define PPIB130_NTASKSEVENTS_SIZE 32                 /*!< (unspecified)                                                        */

#define PPIB131_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB131_NTASKSEVENTS_MAX 23                  /*!< (unspecified)                                                        */
#define PPIB131_NTASKSEVENTS_SIZE 24                 /*!< (unspecified)                                                        */

