adamkondraciuk/nrfx/mdk/nrf54h20_engb_sysctrl_peripherals.h
/*Comparator*/
#define COMP_PRESENT 1
#define COMP_COUNT 1

#define COMP_GF22N 1                                 /*!< (unspecified)                                                        */
#define COMP_TSMC22N 0                               /*!< (unspecified)                                                        */

/*Low-power comparator*/
#define LPCOMP_PRESENT 1
#define LPCOMP_COUNT 1

#define LPCOMP_GF22N 1                               /*!< (unspecified)                                                        */
#define LPCOMP_TSMC22N 0                             /*!< (unspecified)                                                        */
#define LPCOMP_RETAIN 1                              /*!< (unspecified)                                                        */
#define LPCOMP_POWER 0                               /*!< (unspecified)                                                        */

/*Temperature Sensor*/
#define TEMP_PRESENT 1
#define TEMP_COUNT 1

#define TEMP_HAS_ATBCONFIG 1                         /*!< (unspecified)                                                        */
#define TEMP_HAS_OVERRIDEPWR 1                       /*!< (unspecified)                                                        */

/*NFC-A compatible radio NFC-A compatible radio*/
#define NFCT_PRESENT 1
#define NFCT_COUNT 1

#define NFCT_EASYDMA5 0                              /*!< (unspecified)                                                        */
#define NFCT_EASYDMATEMP 1                           /*!< (unspecified)                                                        */
#define NFCT_BUSERROR_PRESENT 0                      /*!< (unspecified)                                                        */
#define NFCT_NFCTFIELDDETCFG_RESET 1                 /*!< Reset value of register NFCTFIELDDETCFG: 1                           */

/*Time division multiplexed audio interface*/
#define TDM_PRESENT 1
#define TDM_COUNT 2

#define TDM130_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define TDM130_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define TDM130_NUM_CHANNELS_MIN 0                    /*!< (unspecified)                                                        */
#define TDM130_NUM_CHANNELS_MAX 7                    /*!< (unspecified)                                                        */
#define TDM130_NUM_CHANNELS_SIZE 8                   /*!< (unspecified)                                                        */
#define TDM130_TDM_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by TDM instance of PCGC Slave -
                                                          [0..3]*/
#define TDM130_TDM_NUM_CLOCK_POWER_PAIR_MAX 3        /*!< Number of clock/power pairs used by TDM instance of PCGC Slave -
                                                          [0..3]*/
#define TDM130_TDM_NUM_CLOCK_POWER_PAIR_SIZE 4       /*!< Number of clock/power pairs used by TDM instance of PCGC Slave -
                                                          [0..3]*/
#define TDM130_TDM_NOTFULLPCPZERO 1                  /*!< (unspecified)                                                        */
#define TDM130_BRGMCK_NUM_CLOCK_POWER_PAIR_MIN 0     /*!< Number of clock/power pairs used by BRGMCK instance of PCGC Slave -
                                                          [brgmck_numpcp]*/
#define TDM130_BRGMCK_NUM_CLOCK_POWER_PAIR_MAX 2     /*!< Number of clock/power pairs used by BRGMCK instance of PCGC Slave -
                                                          [brgmck_numpcp]*/
#define TDM130_BRGMCK_NUM_CLOCK_POWER_PAIR_SIZE 3    /*!< Number of clock/power pairs used by BRGMCK instance of PCGC Slave -
                                                          [brgmck_numpcp]*/
#define TDM130_BRGMCK_NOTFULLPCPZERO 1               /*!< (unspecified)                                                        */
#define TDM130_BRGSCK_NUM_CLOCK_POWER_PAIR_MIN 0     /*!< Number of clock/power pairs used by BRGSCK instance of PCGC Slave -
                                                          [brgsck_numpcp]*/
#define TDM130_BRGSCK_NUM_CLOCK_POWER_PAIR_MAX 2     /*!< Number of clock/power pairs used by BRGSCK instance of PCGC Slave -
                                                          [brgsck_numpcp]*/
#define TDM130_BRGSCK_NUM_CLOCK_POWER_PAIR_SIZE 3    /*!< Number of clock/power pairs used by BRGSCK instance of PCGC Slave -
                                                          [brgsck_numpcp]*/
#define TDM130_BRGSCK_NOTFULLPCPZERO 1               /*!< (unspecified)                                                        */
#define TDM130_DMARX_NUM_CLOCK_POWER_PAIR_MIN 0      /*!< Number of clock/power pairs used by DMARX instance of PCGC Slave -
                                                          [dmarx_numpcp]*/
#define TDM130_DMARX_NUM_CLOCK_POWER_PAIR_MAX 1      /*!< Number of clock/power pairs used by DMARX instance of PCGC Slave -
                                                          [dmarx_numpcp]*/
#define TDM130_DMARX_NUM_CLOCK_POWER_PAIR_SIZE 2     /*!< Number of clock/power pairs used by DMARX instance of PCGC Slave -
                                                          [dmarx_numpcp]*/
#define TDM130_DMARX_NOTFULLPCPZERO 1                /*!< (unspecified)                                                        */
#define TDM130_DMATX_NUM_CLOCK_POWER_PAIR_MIN 0      /*!< Number of clock/power pairs used by DMATX instance of PCGC Slave -
                                                          [dmatx_numpcp]*/
#define TDM130_DMATX_NUM_CLOCK_POWER_PAIR_MAX 1      /*!< Number of clock/power pairs used by DMATX instance of PCGC Slave -
                                                          [dmatx_numpcp]*/
#define TDM130_DMATX_NUM_CLOCK_POWER_PAIR_SIZE 2     /*!< Number of clock/power pairs used by DMATX instance of PCGC Slave -
                                                          [dmatx_numpcp]*/
#define TDM130_DMATX_NOTFULLPCPZERO 1                /*!< (unspecified)                                                        */
#define TDM130_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define TDM130_EASYDMAMODEINCLUDED 1                 /*!< (unspecified)                                                        */
#define TDM130_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define TDM130_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define TDM130_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define TDM130_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

#define TDM131_EASYDMA5 1                            /*!< (unspecified)                                                        */
#define TDM131_EASYDMATEMP 0                         /*!< (unspecified)                                                        */
#define TDM131_NUM_CHANNELS_MIN 0                    /*!< (unspecified)                                                        */
#define TDM131_NUM_CHANNELS_MAX 7                    /*!< (unspecified)                                                        */
#define TDM131_NUM_CHANNELS_SIZE 8                   /*!< (unspecified)                                                        */
#define TDM131_TDM_NUM_CLOCK_POWER_PAIR_MIN 0        /*!< Number of clock/power pairs used by TDM instance of PCGC Slave -
                                                          [0..3]*/
#define TDM131_TDM_NUM_CLOCK_POWER_PAIR_MAX 3        /*!< Number of clock/power pairs used by TDM instance of PCGC Slave -
                                                          [0..3]*/
#define TDM131_TDM_NUM_CLOCK_POWER_PAIR_SIZE 4       /*!< Number of clock/power pairs used by TDM instance of PCGC Slave -
                                                          [0..3]*/
#define TDM131_TDM_NOTFULLPCPZERO 1                  /*!< (unspecified)                                                        */
#define TDM131_BRGMCK_NUM_CLOCK_POWER_PAIR_MIN 0     /*!< Number of clock/power pairs used by BRGMCK instance of PCGC Slave -
                                                          [brgmck_numpcp]*/
#define TDM131_BRGMCK_NUM_CLOCK_POWER_PAIR_MAX 2     /*!< Number of clock/power pairs used by BRGMCK instance of PCGC Slave -
                                                          [brgmck_numpcp]*/
#define TDM131_BRGMCK_NUM_CLOCK_POWER_PAIR_SIZE 3    /*!< Number of clock/power pairs used by BRGMCK instance of PCGC Slave -
                                                          [brgmck_numpcp]*/
#define TDM131_BRGMCK_NOTFULLPCPZERO 1               /*!< (unspecified)                                                        */
#define TDM131_BRGSCK_NUM_CLOCK_POWER_PAIR_MIN 0     /*!< Number of clock/power pairs used by BRGSCK instance of PCGC Slave -
                                                          [brgsck_numpcp]*/
#define TDM131_BRGSCK_NUM_CLOCK_POWER_PAIR_MAX 2     /*!< Number of clock/power pairs used by BRGSCK instance of PCGC Slave -
                                                          [brgsck_numpcp]*/
#define TDM131_BRGSCK_NUM_CLOCK_POWER_PAIR_SIZE 3    /*!< Number of clock/power pairs used by BRGSCK instance of PCGC Slave -
                                                          [brgsck_numpcp]*/
#define TDM131_BRGSCK_NOTFULLPCPZERO 1               /*!< (unspecified)                                                        */
#define TDM131_DMARX_NUM_CLOCK_POWER_PAIR_MIN 0      /*!< Number of clock/power pairs used by DMARX instance of PCGC Slave -
                                                          [dmarx_numpcp]*/
#define TDM131_DMARX_NUM_CLOCK_POWER_PAIR_MAX 1      /*!< Number of clock/power pairs used by DMARX instance of PCGC Slave -
                                                          [dmarx_numpcp]*/
#define TDM131_DMARX_NUM_CLOCK_POWER_PAIR_SIZE 2     /*!< Number of clock/power pairs used by DMARX instance of PCGC Slave -
                                                          [dmarx_numpcp]*/
#define TDM131_DMARX_NOTFULLPCPZERO 1                /*!< (unspecified)                                                        */
#define TDM131_DMATX_NUM_CLOCK_POWER_PAIR_MIN 0      /*!< Number of clock/power pairs used by DMATX instance of PCGC Slave -
                                                          [dmatx_numpcp]*/
#define TDM131_DMATX_NUM_CLOCK_POWER_PAIR_MAX 1      /*!< Number of clock/power pairs used by DMATX instance of PCGC Slave -
                                                          [dmatx_numpcp]*/
#define TDM131_DMATX_NUM_CLOCK_POWER_PAIR_SIZE 2     /*!< Number of clock/power pairs used by DMATX instance of PCGC Slave -
                                                          [dmatx_numpcp]*/
#define TDM131_DMATX_NOTFULLPCPZERO 1                /*!< (unspecified)                                                        */
#define TDM131_EASYDMALISTINCLUDED 0                 /*!< (unspecified)                                                        */
#define TDM131_EASYDMAMODEINCLUDED 1                 /*!< (unspecified)                                                        */
#define TDM131_EASYDMAFULLLPMODEINCLUDED 0           /*!< (unspecified)                                                        */
#define TDM131_EASYDMAPATTERNMATCHERINCLUDED 0       /*!< (unspecified)                                                        */
#define TDM131_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                   */
#define TDM131_EASYDMASTOPTASKINCLUDED 1             /*!< (unspecified)                                                        */

/*Pulse Density Modulation (Digital Microphone) Interface*/
#define PDM_PRESENT 1
#define PDM_COUNT 1

#define PDM_EASYDMA5 0                               /*!< (unspecified)                                                        */
#define PDM_EASYDMATEMP 1                            /*!< (unspecified)                                                        */
#define PDM_SAMPLE16 0                               /*!< (unspecified)                                                        */
#define PDM_SAMPLE48 1                               /*!< (unspecified)                                                        */
#define PDM_EASYDMALISTINCLUDED 0                    /*!< (unspecified)                                                        */
#define PDM_EASYDMAMODEINCLUDED 0                    /*!< (unspecified)                                                        */
#define PDM_EASYDMAFULLLPMODEINCLUDED 0              /*!< (unspecified)                                                        */
#define PDM_EASYDMAPATTERNMATCHERINCLUDED 0          /*!< (unspecified)                                                        */
#define PDM_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                      */
#define PDM_EASYDMASTOPTASKINCLUDED 1                /*!< (unspecified)                                                        */

